
// src/utils/region-data.ts

interface Region {
  text: string;
  value: string;
  children?: Region[];
}

export const regionData: Region[] = [
  {
    "text": "北京市",
    "value": "110000",
    "children": [
      {
        "text": "北京市",
        "value": "110100",
        "children": [
          { "text": "东城区", "value": "110101" },
          { "text": "西城区", "value": "110102" },
          { "text": "朝阳区", "value": "110105" },
          { "text": "丰台区", "value": "110106" },
          { "text": "石景山区", "value": "110107" },
          { "text": "海淀区", "value": "110108" },
          { "text": "门头沟区", "value": "110109" },
          { "text": "房山区", "value": "110111" },
          { "text": "通州区", "value": "110112" },
          { "text": "顺义区", "value": "110113" },
          { "text": "昌平区", "value": "110114" },
          { "text": "大兴区", "value": "110115" },
          { "text": "怀柔区", "value": "110116" },
          { "text": "平谷区", "value": "110117" },
          { "text": "密云区", "value": "110118" },
          { "text": "延庆区", "value": "110119" }
        ]
      }
    ]
  },
  {
    "text": "天津市",
    "value": "120000",
    "children": [
      {
        "text": "天津市",
        "value": "120100",
        "children": [
          { "text": "和平区", "value": "120101" },
          { "text": "河东区", "value": "120102" },
          { "text": "河西区", "value": "120103" },
          { "text": "南开区", "value": "120104" },
          { "text": "河北区", "value": "120105" },
          { "text": "红桥区", "value": "120106" },
          { "text": "东丽区", "value": "120110" },
          { "text": "西青区", "value": "120111" },
          { "text": "津南区", "value": "120112" },
          { "text": "北辰区", "value": "120113" },
          { "text": "武清区", "value": "120114" },
          { "text": "宝坻区", "value": "120115" },
          { "text": "滨海新区", "value": "120116" },
          { "text": "宁河区", "value": "120117" },
          { "text": "静海区", "value": "120118" },
          { "text": "蓟州区", "value": "120119" }
        ]
      }
    ]
  },
  {
    "text": "河北省",
    "value": "130000",
    "children": [
      {
        "text": "石家庄市",
        "value": "130100",
        "children": [
          { "text": "长安区", "value": "130102" },
          { "text": "桥西区", "value": "130104" },
          { "text": "新华区", "value": "130105" },
          { "text": "井陉矿区", "value": "130107" },
          { "text": "裕华区", "value": "130108" },
          { "text": "藁城区", "value": "130109" },
          { "text": "鹿泉区", "value": "130110" },
          { "text": "栾城区", "value": "130111" },
          { "text": "井陉县", "value": "130121" },
          { "text": "正定县", "value": "130123" },
          { "text": "行唐县", "value": "130125" },
          { "text": "灵寿县", "value": "130126" },
          { "text": "高邑县", "value": "130127" },
          { "text": "深泽县", "value": "130128" },
          { "text": "赞皇县", "value": "130129" },
          { "text": "无极县", "value": "130130" },
          { "text": "平山县", "value": "130131" },
          { "text": "元氏县", "value": "130132" },
          { "text": "赵县", "value": "130133" },
          { "text": "辛集市", "value": "130181" },
          { "text": "晋州市", "value": "130183" },
          { "text": "新乐市", "value": "130184" }
        ]
      },
      {
        "text": "唐山市",
        "value": "130200",
        "children": [
          { "text": "路南区", "value": "130202" },
          { "text": "路北区", "value": "130203" },
          { "text": "古冶区", "value": "130204" },
          { "text": "开平区", "value": "130205" },
          { "text": "丰南区", "value": "130207" },
          { "text": "丰润区", "value": "130208" },
          { "text": "曹妃甸区", "value": "130209" },
          { "text": "滦州市", "value": "130223" },
          { "text": "滦南县", "value": "130224" },
          { "text": "乐亭县", "value": "130225" },
          { "text": "迁西县", "value": "130227" },
          { "text": "玉田县", "value": "130229" },
          { "text": "遵化市", "value": "130281" },
          { "text": "迁安市", "value": "130283" }
        ]
      },
      {
        "text": "秦皇岛市",
        "value": "130300",
        "children": [
          { "text": "海港区", "value": "130302" },
          { "text": "山海关区", "value": "130303" },
          { "text": "北戴河区", "value": "130304" },
          { "text": "抚宁区", "value": "130306" },
          { "text": "青龙满族自治县", "value": "130321" },
          { "text": "昌黎县", "value": "130322" },
          { "text": "卢龙县", "value": "130324" }
        ]
      },
      {
        "text": "邯郸市",
        "value": "130400",
        "children": [
          { "text": "邯山区", "value": "130402" },
          { "text": "丛台区", "value": "130403" },
          { "text": "复兴区", "value": "130404" },
          { "text": "峰峰矿区", "value": "130406" },
          { "text": "肥乡区", "value": "130407" },
          { "text": "永年区", "value": "130408" },
          { "text": "临漳县", "value": "130423" },
          { "text": "成安县", "value": "130424" },
          { "text": "大名县", "value": "130425" },
          { "text": "涉县", "value": "130426" },
          { "text": "磁县", "value": "130427" },
          { "text": "邱县", "value": "130430" },
          { "text": "鸡泽县", "value": "130431" },
          { "text": "广平县", "value": "130432" },
          { "text": "馆陶县", "value": "130433" },
          { "text": "魏县", "value": "130434" },
          { "text": "曲周县", "value": "130435" },
          { "text": "武安市", "value": "130481" }
        ]
      },
      {
        "text": "邢台市",
        "value": "130500",
        "children": [
          { "text": "襄都区", "value": "130502" },
          { "text": "信都区", "value": "130503" },
          { "text": "任泽区", "value": "130505" },
          { "text": "南和区", "value": "130506" },
          { "text": "临城县", "value": "130522" },
          { "text": "内丘县", "value": "130523" },
          { "text": "柏乡县", "value": "130524" },
          { "text": "隆尧县", "value": "130525" },
          { "text": "宁晋县", "value": "130528" },
          { "text": "巨鹿县", "value": "130529" },
          { "text": "新河县", "value": "130530" },
          { "text": "广宗县", "value": "130531" },
          { "text": "平乡县", "value": "130532" },
          { "text": "威县", "value": "130533" },
          { "text": "清河县", "value": "130534" },
          { "text": "临西县", "value": "130535" },
          { "text": "南宫市", "value": "130581" },
          { "text": "沙河市", "value": "130582" }
        ]
      },
      {
        "text": "保定市",
        "value": "130600",
        "children": [
          { "text": "竞秀区", "value": "130602" },
          { "text": "莲池区", "value": "130606" },
          { "text": "满城区", "value": "130607" },
          { "text": "清苑区", "value": "130608" },
          { "text": "徐水区", "value": "130609" },
          { "text": "涞水县", "value": "130623" },
          { "text": "阜平县", "value": "130624" },
          { "text": "定兴县", "value": "130626" },
          { "text": "唐县", "value": "130627" },
          { "text": "高阳县", "value": "130628" },
          { "text": "容城县", "value": "130629" },
          { "text": "涞源县", "value": "130630" },
          { "text": "望都县", "value": "130631" },
          { "text": "安新县", "value": "130632" },
          { "text": "易县", "value": "130633" },
          { "text": "曲阳县", "value": "130634" },
          { "text": "蠡县", "value": "130635" },
          { "text": "顺平县", "value": "130636" },
          { "text": "博野县", "value": "130637" },
          { "text": "雄县", "value": "130638" },
          { "text": "涿州市", "value": "130681" },
          { "text": "定州市", "value": "130682" },
          { "text": "安国市", "value": "130683" },
          { "text": "高碑店市", "value": "130684" }
        ]
      },
      {
        "text": "张家口市",
        "value": "130700",
        "children": [
          { "text": "桥东区", "value": "130702" },
          { "text": "桥西区", "value": "130703" },
          { "text": "宣化区", "value": "130705" },
          { "text": "下花园区", "value": "130706" },
          { "text": "万全区", "value": "130708" },
          { "text": "崇礼区", "value": "130709" },
          { "text": "张北县", "value": "130722" },
          { "text": "康保县", "value": "130723" },
          { "text": "沽源县", "value": "130724" },
          { "text": "尚义县", "value": "130725" },
          { "text": "蔚县", "value": "130726" },
          { "text": "阳原县", "value": "130727" },
          { "text": "怀安县", "value": "130728" },
          { "text": "怀来县", "value": "130730" },
          { "text": "涿鹿县", "value": "130731" },
          { "text": "赤城县", "value": "130732" }
        ]
      },
      {
        "text": "承德市",
        "value": "130800",
        "children": [
          { "text": "双桥区", "value": "130802" },
          { "text": "双滦区", "value": "130803" },
          { "text": "鹰手营子矿区", "value": "130804" },
          { "text": "承德县", "value": "130821" },
          { "text": "兴隆县", "value": "130822" },
          { "text": "滦平县", "value": "130824" },
          { "text": "隆化县", "value": "130825" },
          { "text": "丰宁满族自治县", "value": "130826" },
          { "text": "宽城满族自治县", "value": "130827" },
          { "text": "围场满族蒙古族自治县", "value": "130828" },
          { "text": "平泉市", "value": "130881" }
        ]
      },
      {
        "text": "沧州市",
        "value": "130900",
        "children": [
          { "text": "新华区", "value": "130902" },
          { "text": "运河区", "value": "130903" },
          { "text": "沧县", "value": "130921" },
          { "text": "青县", "value": "130922" },
          { "text": "东光县", "value": "130923" },
          { "text": "海兴县", "value": "130924" },
          { "text": "盐山县", "value": "130925" },
          { "text": "肃宁县", "value": "130926" },
          { "text": "南皮县", "value": "130927" },
          { "text": "吴桥县", "value": "130928" },
          { "text": "献县", "value": "130929" },
          { "text": "孟村回族自治县", "value": "130930" },
          { "text": "泊头市", "value": "130981" },
          { "text": "任丘市", "value": "130982" },
          { "text": "黄骅市", "value": "130983" },
          { "text": "河间市", "value": "130984" }
        ]
      },
      {
        "text": "廊坊市",
        "value": "131000",
        "children": [
          { "text": "安次区", "value": "131002" },
          { "text": "广阳区", "value": "131003" },
          { "text": "固安县", "value": "131022" },
          { "text": "永清县", "value": "131023" },
          { "text": "香河县", "value": "131024" },
          { "text": "大城县", "value": "131025" },
          { "text": "文安县", "value": "131026" },
          { "text": "大厂回族自治县", "value": "131028" },
          { "text": "霸州市", "value": "131081" },
          { "text": "三河市", "value": "131082" }
        ]
      },
      {
        "text": "衡水市",
        "value": "131100",
        "children": [
          { "text": "桃城区", "value": "131102" },
          { "text": "冀州区", "value": "131103" },
          { "text": "枣强县", "value": "131121" },
          { "text": "武邑县", "value": "131122" },
          { "text": "武强县", "value": "131123" },
          { "text": "饶阳县", "value": "131124" },
          { "text": "安平县", "value": "131125" },
          { "text": "故城县", "value": "131126" },
          { "text": "景县", "value": "131127" },
          { "text": "阜城县", "value": "131128" },
          { "text": "深州市", "value": "131182" }
        ]
      }
    ]
  },
  {
    "text": "山西省",
    "value": "140000",
    "children": [
      {
        "text": "太原市",
        "value": "140100",
        "children": [
          { "text": "小店区", "value": "140105" },
          { "text": "迎泽区", "value": "140106" },
          { "text": "杏花岭区", "value": "140107" },
          { "text": "尖草坪区", "value": "140108" },
          { "text": "万柏林区", "value": "140109" },
          { "text": "晋源区", "value": "140110" },
          { "text": "清徐县", "value": "140121" },
          { "text": "阳曲县", "value": "140122" },
          { "text": "娄烦县", "value": "140123" },
          { "text": "古交市", "value": "140181" }
        ]
      },
      {
        "text": "大同市",
        "value": "140200",
        "children": [
          { "text": "新荣区", "value": "140212" },
          { "text": "平城区", "value": "140213" },
          { "text": "云冈区", "value": "140214" },
          { "text": "云州区", "value": "140215" },
          { "text": "阳高县", "value": "140221" },
          { "text": "天镇县", "value": "140222" },
          { "text": "广灵县", "value": "140223" },
          { "text": "灵丘县", "value": "140224" },
          { "text": "浑源县", "value": "140225" },
          { "text": "左云县", "value": "140226" }
        ]
      },
      {
        "text": "阳泉市",
        "value": "140300",
        "children": [
          { "text": "城区", "value": "140302" },
          { "text": "矿区", "value": "140303" },
          { "text": "郊区", "value": "140311" },
          { "text": "平定县", "value": "140321" },
          { "text": "盂县", "value": "140322" }
        ]
      },
      {
        "text": "长治市",
        "value": "140400",
        "children": [
          { "text": "潞州区", "value": "140403" },
          { "text": "上党区", "value": "140404" },
          { "text": "屯留区", "value": "140405" },
          { "text": "潞城区", "value": "140406" },
          { "text": "襄垣县", "value": "140423" },
          { "text": "平顺县", "value": "140425" },
          { "text": "黎城县", "value": "140426" },
          { "text": "壶关县", "value": "140427" },
          { "text": "长子县", "value": "140428" },
          { "text": "武乡县", "value": "140429" },
          { "text": "沁县", "value": "140430" },
          { "text": "沁源县", "value": "140431" }
        ]
      },
      {
        "text": "晋城市",
        "value": "140500",
        "children": [
          { "text": "城区", "value": "140502" },
          { "text": "沁水县", "value": "140521" },
          { "text": "阳城县", "value": "140522" },
          { "text": "陵川县", "value": "140524" },
          { "text": "泽州县", "value": "140525" },
          { "text": "高平市", "value": "140581" }
        ]
      },
      {
        "text": "朔州市",
        "value": "140600",
        "children": [
          { "text": "朔城区", "value": "140602" },
          { "text": "平鲁区", "value": "140603" },
          { "text": "山阴县", "value": "140621" },
          { "text": "应县", "value": "140622" },
          { "text": "右玉县", "value": "140623" },
          { "text": "怀仁市", "value": "140681" }
        ]
      },
      {
        "text": "晋中市",
        "value": "140700",
        "children": [
          { "text": "榆次区", "value": "140702" },
          { "text": "太谷区", "value": "140703" },
          { "text": "榆社县", "value": "140721" },
          { "text": "左权县", "value": "140722" },
          { "text": "和顺县", "value": "140723" },
          { "text": "昔阳县", "value": "140724" },
          { "text": "寿阳县", "value": "140725" },
          { "text": "祁县", "value": "140727" },
          { "text": "平遥县", "value": "140728" },
          { "text": "灵石县", "value": "140729" },
          { "text": "介休市", "value": "140781" }
        ]
      },
      {
        "text": "运城市",
        "value": "140800",
        "children": [
          { "text": "盐湖区", "value": "140802" },
          { "text": "临猗县", "value": "140821" },
          { "text": "万荣县", "value": "140822" },
          { "text": "闻喜县", "value": "140823" },
          { "text": "稷山县", "value": "140824" },
          { "text": "新绛县", "value": "140825" },
          { "text": "绛县", "value": "140826" },
          { "text": "垣曲县", "value": "140827" },
          { "text": "夏县", "value": "140828" },
          { "text": "平陆县", "value": "140829" },
          { "text": "芮城县", "value": "140830" },
          { "text": "永济市", "value": "140881" },
          { "text": "河津市", "value": "140882" }
        ]
      },
      {
        "text": "忻州市",
        "value": "140900",
        "children": [
          { "text": "忻府区", "value": "140902" },
          { "text": "定襄县", "value": "140921" },
          { "text": "五台县", "value": "140922" },
          { "text": "代县", "value": "140923" },
          { "text": "繁峙县", "value": "140924" },
          { "text": "宁武县", "value": "140925" },
          { "text": "静乐县", "value": "140926" },
          { "text": "神池县", "value": "140927" },
          { "text": "五寨县", "value": "140928" },
          { "text": "岢岚县", "value": "140929" },
          { "text": "河曲县", "value": "140930" },
          { "text": "保德县", "value": "140931" },
          { "text": "偏关县", "value": "140932" },
          { "text": "原平市", "value": "140981" }
        ]
      },
      {
        "text": "临汾市",
        "value": "141000",
        "children": [
          { "text": "尧都区", "value": "141002" },
          { "text": "曲沃县", "value": "141021" },
          { "text": "翼城县", "value": "141022" },
          { "text": "襄汾县", "value": "141023" },
          { "text": "洪洞县", "value": "141024" },
          { "text": "古县", "value": "141025" },
          { "text": "安泽县", "value": "141026" },
          { "text": "浮山县", "value": "141027" },
          { "text": "吉县", "value": "141028" },
          { "text": "乡宁县", "value": "141029" },
          { "text": "大宁县", "value": "141030" },
          { "text": "隰县", "value": "141031" },
          { "text": "永和县", "value": "141032" },
          { "text": "蒲县", "value": "141033" },
          { "text": "汾西县", "value": "141034" },
          { "text": "侯马市", "value": "141081" },
          { "text": "霍州市", "value": "141082" }
        ]
      },
      {
        "text": "吕梁市",
        "value": "141100",
        "children": [
          { "text": "离石区", "value": "141102" },
          { "text": "文水县", "value": "141121" },
          { "text": "交城县", "value": "141122" },
          { "text": "兴县", "value": "141123" },
          { "text": "临县", "value": "141124" },
          { "text": "柳林县", "value": "141125" },
          { "text": "石楼县", "value": "141126" },
          { "text": "岚县", "value": "141127" },
          { "text": "方山县", "value": "141128" },
          { "text": "中阳县", "value": "141129" },
          { "text": "交口县", "value": "141130" },
          { "text": "孝义市", "value": "141181" },
          { "text": "汾阳市", "value": "141182" }
        ]
      }
    ]
  },
  {
    "text": "内蒙古自治区",
    "value": "150000",
    "children": [
      {
        "text": "呼和浩特市",
        "value": "150100",
        "children": [
          { "text": "新城区", "value": "150102" },
          { "text": "回民区", "value": "150103" },
          { "text": "玉泉区", "value": "150104" },
          { "text": "赛罕区", "value": "150105" },
          { "text": "土默特左旗", "value": "150121" },
          { "text": "托克托县", "value": "150122" },
          { "text": "和林格尔县", "value": "150123" },
          { "text": "清水河县", "value": "150124" },
          { "text": "武川县", "value": "150125" }
        ]
      },
      {
        "text": "包头市",
        "value": "150200",
        "children": [
          { "text": "东河区", "value": "150202" },
          { "text": "昆都仑区", "value": "150203" },
          { "text": "青山区", "value": "150204" },
          { "text": "石拐区", "value": "150205" },
          { "text": "白云鄂博矿区", "value": "150206" },
          { "text": "九原区", "value": "150207" },
          { "text": "土默特右旗", "value": "150221" },
          { "text": "固阳县", "value": "150222" },
          { "text": "达尔罕茂明安联合旗", "value": "150223" }
        ]
      },
      {
        "text": "乌海市",
        "value": "150300",
        "children": [
          { "text": "海勃湾区", "value": "150302" },
          { "text": "海南区", "value": "150303" },
          { "text": "乌达区", "value": "150304" }
        ]
      },
      {
        "text": "赤峰市",
        "value": "150400",
        "children": [
          { "text": "红山区", "value": "150402" },
          { "text": "元宝山区", "value": "150403" },
          { "text": "松山区", "value": "150404" },
          { "text": "阿鲁科尔沁旗", "value": "150421" },
          { "text": "巴林左旗", "value": "150422" },
          { "text": "巴林右旗", "value": "150423" },
          { "text": "林西县", "value": "150424" },
          { "text": "克什克腾旗", "value": "150425" },
          { "text": "翁牛特旗", "value": "150426" },
          { "text": "喀喇沁旗", "value": "150428" },
          { "text": "宁城县", "value": "150429" },
          { "text": "敖汉旗", "value": "150430" }
        ]
      },
      {
        "text": "通辽市",
        "value": "150500",
        "children": [
          { "text": "科尔沁区", "value": "150502" },
          { "text": "科尔沁左翼中旗", "value": "150521" },
          { "text": "科尔沁左翼后旗", "value": "150522" },
          { "text": "开鲁县", "value": "150523" },
          { "text": "库伦旗", "value": "150524" },
          { "text": "奈曼旗", "value": "150525" },
          { "text": "扎鲁特旗", "value": "150526" },
          { "text": "霍林郭勒市", "value": "150581" }
        ]
      },
      {
        "text": "鄂尔多斯市",
        "value": "150600",
        "children": [
          { "text": "东胜区", "value": "150602" },
          { "text": "康巴什区", "value": "150603" },
          { "text": "达拉特旗", "value": "150621" },
          { "text": "准格尔旗", "value": "150622" },
          { "text": "鄂托克前旗", "value": "150623" },
          { "text": "鄂托克旗", "value": "150624" },
          { "text": "杭锦旗", "value": "150625" },
          { "text": "乌审旗", "value": "150626" },
          { "text": "伊金霍洛旗", "value": "150627" }
        ]
      },
      {
        "text": "呼伦贝尔市",
        "value": "150700",
        "children": [
          { "text": "海拉尔区", "value": "150702" },
          { "text": "扎赉诺尔区", "value": "150703" },
          { "text": "阿荣旗", "value": "150721" },
          { "text": "莫力达瓦达斡尔族自治旗", "value": "150722" },
          { "text": "鄂伦春自治旗", "value": "150723" },
          { "text": "鄂温克族自治旗", "value": "150724" },
          { "text": "陈巴尔虎旗", "value": "150725" },
          { "text": "新巴尔虎左旗", "value": "150726" },
          { "text": "新巴尔虎右旗", "value": "150727" },
          { "text": "满洲里市", "value": "150781" },
          { "text": "牙克石市", "value": "150782" },
          { "text": "扎兰屯市", "value": "150783" },
          { "text": "额尔古纳市", "value": "150784" },
          { "text": "根河市", "value": "150785" }
        ]
      },
      {
        "text": "巴彦淖尔市",
        "value": "150800",
        "children": [
          { "text": "临河区", "value": "150802" },
          { "text": "五原县", "value": "150821" },
          { "text": "磴口县", "value": "150822" },
          { "text": "乌拉特前旗", "value": "150823" },
          { "text": "乌拉特中旗", "value": "150824" },
          { "text": "乌拉特后旗", "value": "150825" },
          { "text": "杭锦后旗", "value": "150826" }
        ]
      },
      {
        "text": "乌兰察布市",
        "value": "150900",
        "children": [
          { "text": "集宁区", "value": "150902" },
          { "text": "卓资县", "value": "150921" },
          { "text": "化德县", "value": "150922" },
          { "text": "商都县", "value": "150923" },
          { "text": "兴和县", "value": "150924" },
          { "text": "凉城县", "value": "150925" },
          { "text": "察哈尔右翼前旗", "value": "150926" },
          { "text": "察哈尔右翼中旗", "value": "150927" },
          { "text": "察哈尔右翼后旗", "value": "150928" },
          { "text": "四子王旗", "value": "150929" },
          { "text": "丰镇市", "value": "150981" }
        ]
      },
      {
        "text": "兴安盟",
        "value": "152200",
        "children": [
          { "text": "乌兰浩特市", "value": "152201" },
          { "text": "阿尔山市", "value": "152202" },
          { "text": "科尔沁右翼前旗", "value": "152221" },
          { "text": "科尔沁右翼中旗", "value": "152222" },
          { "text": "扎赉特旗", "value": "152223" },
          { "text": "突泉县", "value": "152224" }
        ]
      },
      {
        "text": "锡林郭勒盟",
        "value": "152500",
        "children": [
          { "text": "二连浩特市", "value": "152501" },
          { "text": "锡林浩特市", "value": "152502" },
          { "text": "阿巴嘎旗", "value": "152522" },
          { "text": "苏尼特左旗", "value": "152523" },
          { "text": "苏尼特右旗", "value": "152524" },
          { "text": "东乌珠穆沁旗", "value": "152525" },
          { "text": "西乌珠穆沁旗", "value": "152526" },
          { "text": "太仆寺旗", "value": "152527" },
          { "text": "镶黄旗", "value": "152528" },
          { "text": "正镶白旗", "value": "152529" },
          { "text": "正蓝旗", "value": "152530" },
          { "text": "多伦县", "value": "152531" }
        ]
      },
      {
        "text": "阿拉善盟",
        "value": "152900",
        "children": [
          { "text": "阿拉善左旗", "value": "152921" },
          { "text": "阿拉善右旗", "value": "152922" },
          { "text": "额济纳旗", "value": "152923" }
        ]
      }
    ]
  },
  {
    "text": "辽宁省",
    "value": "210000",
    "children": [
      {
        "text": "沈阳市",
        "value": "210100",
        "children": [
          { "text": "和平区", "value": "210102" },
          { "text": "沈河区", "value": "210103" },
          { "text": "大东区", "value": "210104" },
          { "text": "皇姑区", "value": "210105" },
          { "text": "铁西区", "value": "210106" },
          { "text": "苏家屯区", "value": "210111" },
          { "text": "浑南区", "value": "210112" },
          { "text": "沈北新区", "value": "210113" },
          { "text": "于洪区", "value": "210114" },
          { "text": "辽中区", "value": "210115" },
          { "text": "康平县", "value": "210123" },
          { "text": "法库县", "value": "210124" },
          { "text": "新民市", "value": "210181" }
        ]
      },
      {
        "text": "大连市",
        "value": "210200",
        "children": [
          { "text": "中山区", "value": "210202" },
          { "text": "西岗区", "value": "210203" },
          { "text": "沙河口区", "value": "210204" },
          { "text": "甘井子区", "value": "210211" },
          { "text": "旅顺口区", "value": "210212" },
          { "text": "金州区", "value": "210213" },
          { "text": "普兰店区", "value": "210214" },
          { "text": "长海县", "value": "210224" },
          { "text": "瓦房店市", "value": "210281" },
          { "text": "庄河市", "value": "210283" }
        ]
      },
      {
        "text": "鞍山市",
        "value": "210300",
        "children": [
          { "text": "铁东区", "value": "210302" },
          { "text": "铁西区", "value": "210303" },
          { "text": "立山区", "value": "210304" },
          { "text": "千山区", "value": "210311" },
          { "text": "台安县", "value": "210321" },
          { "text": "岫岩满族自治县", "value": "210323" },
          { "text": "海城市", "value": "210381" }
        ]
      },
      {
        "text": "抚顺市",
        "value": "210400",
        "children": [
          { "text": "新抚区", "value": "210402" },
          { "text": "东洲区", "value": "210403" },
          { "text": "望花区", "value": "210404" },
          { "text": "顺城区", "value": "210411" },
          { "text": "抚顺县", "value": "210421" },
          { "text": "新宾满族自治县", "value": "210422" },
          { "text": "清原满族自治县", "value": "210423" }
        ]
      },
      {
        "text": "本溪市",
        "value": "210500",
        "children": [
          { "text": "平山区", "value": "210502" },
          { "text": "溪湖区", "value": "210503" },
          { "text": "明山区", "value": "210504" },
          { "text": "南芬区", "value": "210505" },
          { "text": "本溪满族自治县", "value": "210521" },
          { "text": "桓仁满族自治县", "value": "210522" }
        ]
      },
      {
        "text": "丹东市",
        "value": "210600",
        "children": [
          { "text": "元宝区", "value": "210602" },
          { "text": "振兴区", "value": "210603" },
          { "text": "振安区", "value": "210604" },
          { "text": "宽甸满族自治县", "value": "210624" },
          { "text": "东港市", "value": "210681" },
          { "text": "凤城市", "value": "210682" }
        ]
      },
      {
        "text": "锦州市",
        "value": "210700",
        "children": [
          { "text": "古塔区", "value": "210702" },
          { "text": "凌河区", "value": "210703" },
          { "text": "太和区", "value": "210711" },
          { "text": "黑山县", "value": "210726" },
          { "text": "义县", "value": "210727" },
          { "text": "凌海市", "value": "210781" },
          { "text": "北镇市", "value": "210782" }
        ]
      },
      {
        "text": "营口市",
        "value": "210800",
        "children": [
          { "text": "站前区", "value": "210802" },
          { "text": "西市区", "value": "210803" },
          { "text": "鲅鱼圈区", "value": "210804" },
          { "text": "老边区", "value": "210811" },
          { "text": "盖州市", "value": "210881" },
          { "text": "大石桥市", "value": "210882" }
        ]
      },
      {
        "text": "阜新市",
        "value": "210900",
        "children": [
          { "text": "海州区", "value": "210902" },
          { "text": "新邱区", "value": "210903" },
          { "text": "太平区", "value": "210904" },
          { "text": "清河门区", "value": "210905" },
          { "text": "细河区", "value": "210911" },
          { "text": "阜新蒙古族自治县", "value": "210921" },
          { "text": "彰武县", "value": "210922" }
        ]
      },
      {
        "text": "辽阳市",
        "value": "211000",
        "children": [
          { "text": "白塔区", "value": "211002" },
          { "text": "文圣区", "value": "211003" },
          { "text": "宏伟区", "value": "211004" },
          { "text": "弓长岭区", "value": "211005" },
          { "text": "太子河区", "value": "211011" },
          { "text": "辽阳县", "value": "211021" },
          { "text": "灯塔市", "value": "211081" }
        ]
      },
      {
        "text": "盘锦市",
        "value": "211100",
        "children": [
          { "text": "双台子区", "value": "211102" },
          { "text": "兴隆台区", "value": "211103" },
          { "text": "大洼区", "value": "211104" },
          { "text": "盘山县", "value": "211122" }
        ]
      },
      {
        "text": "铁岭市",
        "value": "211200",
        "children": [
          { "text": "银州区", "value": "211202" },
          { "text": "清河区", "value": "211204" },
          { "text": "铁岭县", "value": "211221" },
          { "text": "西丰县", "value": "211223" },
          { "text": "昌图县", "value": "211224" },
          { "text": "调兵山市", "value": "211281" },
          { "text": "开原市", "value": "211282" }
        ]
      },
      {
        "text": "朝阳市",
        "value": "211300",
        "children": [
          { "text": "双塔区", "value": "211302" },
          { "text": "龙城区", "value": "211303" },
          { "text": "朝阳县", "value": "211321" },
          { "text": "建平县", "value": "211322" },
          { "text": "喀喇沁左翼蒙古族自治县", "value": "211324" },
          { "text": "北票市", "value": "211381" },
          { "text": "凌源市", "value": "211382" }
        ]
      },
      {
        "text": "葫芦岛市",
        "value": "211400",
        "children": [
          { "text": "连山区", "value": "211402" },
          { "text": "龙港区", "value": "211403" },
          { "text": "南票区", "value": "211404" },
          { "text": "绥中县", "value": "211421" },
          { "text": "建昌县", "value": "211422" },
          { "text": "兴城市", "value": "211481" }
        ]
      }
    ]
  },
  {
    "text": "吉林省",
    "value": "220000",
    "children": [
      {
        "text": "长春市",
        "value": "220100",
        "children": [
          { "text": "南关区", "value": "220102" },
          { "text": "宽城区", "value": "220103" },
          { "text": "朝阳区", "value": "220104" },
          { "text": "二道区", "value": "220105" },
          { "text": "绿园区", "value": "220106" },
          { "text": "双阳区", "value": "220112" },
          { "text": "九台区", "value": "220113" },
          { "text": "农安县", "value": "220122" },
          { "text": "榆树市", "value": "220182" },
          { "text": "德惠市", "value": "220183" },
          { "text": "公主岭市", "value": "220184" }
        ]
      },
      {
        "text": "吉林市",
        "value": "220200",
        "children": [
          { "text": "昌邑区", "value": "220202" },
          { "text": "龙潭区", "value": "220203" },
          { "text": "船营区", "value": "220204" },
          { "text": "丰满区", "value": "220211" },
          { "text": "永吉县", "value": "220221" },
          { "text": "蛟河市", "value": "220281" },
          { "text": "桦甸市", "value": "220282" },
          { "text": "舒兰市", "value": "220283" },
          { "text": "磐石市", "value": "220284" }
        ]
      },
      {
        "text": "四平市",
        "value": "220300",
        "children": [
          { "text": "铁西区", "value": "220302" },
          { "text": "铁东区", "value": "220303" },
          { "text": "梨树县", "value": "220322" },
          { "text": "伊通满族自治县", "value": "220323" },
          { "text": "双辽市", "value": "220382" }
        ]
      },
      {
        "text": "辽源市",
        "value": "220400",
        "children": [
          { "text": "龙山区", "value": "220402" },
          { "text": "西安区", "value": "220403" },
          { "text": "东丰县", "value": "220421" },
          { "text": "东辽县", "value": "220422" }
        ]
      },
      {
        "text": "通化市",
        "value": "220500",
        "children": [
          { "text": "东昌区", "value": "220502" },
          { "text": "二道江区", "value": "220503" },
          { "text": "通化县", "value": "220521" },
          { "text": "辉南县", "value": "220523" },
          { "text": "柳河县", "value": "220524" },
          { "text": "梅河口市", "value": "220581" },
          { "text": "集安市", "value": "220582" }
        ]
      },
      {
        "text": "白山市",
        "value": "220600",
        "children": [
          { "text": "浑江区", "value": "220602" },
          { "text": "江源区", "value": "220605" },
          { "text": "抚松县", "value": "220621" },
          { "text": "靖宇县", "value": "220622" },
          { "text": "长白朝鲜族自治县", "value": "220623" },
          { "text": "临江市", "value": "220681" }
        ]
      },
      {
        "text": "松原市",
        "value": "220700",
        "children": [
          { "text": "宁江区", "value": "220702" },
          { "text": "前郭尔罗斯蒙古族自治县", "value": "220721" },
          { "text": "长岭县", "value": "220722" },
          { "text": "乾安县", "value": "220723" },
          { "text": "扶余市", "value": "220781" }
        ]
      },
      {
        "text": "白城市",
        "value": "220800",
        "children": [
          { "text": "洮北区", "value": "220802" },
          { "text": "镇赉县", "value": "220821" },
          { "text": "通榆县", "value": "220822" },
          { "text": "洮南市", "value": "220881" },
          { "text": "大安市", "value": "220882" }
        ]
      },
      {
        "text": "延边朝鲜族自治州",
        "value": "222400",
        "children": [
          { "text": "延吉市", "value": "222401" },
          { "text": "图们市", "value": "222402" },
          { "text": "敦化市", "value": "222403" },
          { "text": "珲春市", "value": "222404" },
          { "text": "龙井市", "value": "222405" },
          { "text": "和龙市", "value": "222406" },
          { "text": "汪清县", "value": "222424" },
          { "text": "安图县", "value": "222426" }
        ]
      }
    ]
  },
  {
    "text": "黑龙江省",
    "value": "230000",
    "children": [
      {
        "text": "哈尔滨市",
        "value": "230100",
        "children": [
          { "text": "道里区", "value": "230102" },
          { "text": "南岗区", "value": "230103" },
          { "text": "道外区", "value": "230104" },
          { "text": "平房区", "value": "230108" },
          { "text": "松北区", "value": "230109" },
          { "text": "香坊区", "value": "230110" },
          { "text": "呼兰区", "value": "230111" },
          { "text": "阿城区", "value": "230112" },
          { "text": "双城区", "value": "230113" },
          { "text": "依兰县", "value": "230123" },
          { "text": "方正县", "value": "230124" },
          { "text": "宾县", "value": "230125" },
          { "text": "巴彦县", "value": "230126" },
          { "text": "木兰县", "value": "230127" },
          { "text": "通河县", "value": "230128" },
          { "text": "延寿县", "value": "230129" },
          { "text": "尚志市", "value": "230183" },
          { "text": "五常市", "value": "230184" }
        ]
      },
      {
        "text": "齐齐哈尔市",
        "value": "230200",
        "children": [
          { "text": "龙沙区", "value": "230202" },
          { "text": "建华区", "value": "230203" },
          { "text": "铁锋区", "value": "230204" },
          { "text": "昂昂溪区", "value": "230205" },
          { "text": "富拉尔基区", "value": "230206" },
          { "text": "碾子山区", "value": "230207" },
          { "text": "梅里斯达斡尔族区", "value": "230208" },
          { "text": "龙江县", "value": "230221" },
          { "text": "依安县", "value": "230223" },
          { "text": "泰来县", "value": "230224" },
          { "text": "甘南县", "value": "230225" },
          { "text": "富裕县", "value": "230227" },
          { "text": "克山县", "value": "230229" },
          { "text": "克东县", "value": "230230" },
          { "text": "拜泉县", "value": "230231" },
          { "text": "讷河市", "value": "230281" }
        ]
      },
      {
        "text": "鸡西市",
        "value": "230300",
        "children": [
          { "text": "鸡冠区", "value": "230302" },
          { "text": "恒山区", "value": "230303" },
          { "text": "滴道区", "value": "230304" },
          { "text": "梨树区", "value": "230305" },
          { "text": "城子河区", "value": "230306" },
          { "text": "麻山区", "value": "230307" },
          { "text": "鸡东县", "value": "230321" },
          { "text": "虎林市", "value": "230381" },
          { "text": "密山市", "value": "230382" }
        ]
      },
      {
        "text": "鹤岗市",
        "value": "230400",
        "children": [
          { "text": "向阳区", "value": "230402" },
          { "text": "工农区", "value": "230403" },
          { "text": "南山区", "value": "230404" },
          { "text": "兴安区", "value": "230405" },
          { "text": "东山区", "value": "230406" },
          { "text": "兴山区", "value": "230407" },
          { "text": "萝北县", "value": "230421" },
          { "text": "绥滨县", "value": "230422" }
        ]
      },
      {
        "text": "双鸭山市",
        "value": "230500",
        "children": [
          { "text": "尖山区", "value": "230502" },
          { "text": "岭东区", "value": "230503" },
          { "text": "四方台区", "value": "230505" },
          { "text": "宝山区", "value": "230506" },
          { "text": "集贤县", "value": "230521" },
          { "text": "友谊县", "value": "230522" },
          { "text": "宝清县", "value": "230523" },
          { "text": "饶河县", "value": "230524" }
        ]
      },
      {
        "text": "大庆市",
        "value": "230600",
        "children": [
          { "text": "萨尔图区", "value": "230602" },
          { "text": "龙凤区", "value": "230603" },
          { "text": "让胡路区", "value": "230604" },
          { "text": "红岗区", "value": "230605" },
          { "text": "大同区", "value": "230606" },
          { "text": "肇州县", "value": "230621" },
          { "text": "肇源县", "value": "230622" },
          { "text": "林甸县", "value": "230623" },
          { "text": "杜尔伯特蒙古族自治县", "value": "230624" }
        ]
      },
      {
        "text": "伊春市",
        "value": "230700",
        "children": [
          { "text": "伊美区", "value": "230702" },
          { "text": "乌翠区", "value": "230703" },
          { "text": "友好区", "value": "230704" },
          { "text": "嘉荫县", "value": "230722" },
          { "text": "汤旺县", "value": "230723" },
          { "text": "丰林县", "value": "230724" },
          { "text": "大箐山县", "value": "230725" },
          { "text": "南岔县", "value": "230726" },
          { "text": "金林区", "value": "230751" },
          { "text": "铁力市", "value": "230781" }
        ]
      },
      {
        "text": "佳木斯市",
        "value": "230800",
        "children": [
          { "text": "向阳区", "value": "230803" },
          { "text": "前进区", "value": "230804" },
          { "text": "东风区", "value": "230805" },
          { "text": "郊区", "value": "230811" },
          { "text": "桦南县", "value": "230822" },
          { "text": "桦川县", "value": "230826" },
          { "text": "汤原县", "value": "230828" },
          { "text": "同江市", "value": "230881" },
          { "text": "富锦市", "value": "230882" },
          { "text": "抚远市", "value": "230883" }
        ]
      },
      {
        "text": "七台河市",
        "value": "230900",
        "children": [
          { "text": "新兴区", "value": "230902" },
          { "text": "桃山区", "value": "230903" },
          { "text": "茄子河区", "value": "230904" },
          { "text": "勃利县", "value": "230921" }
        ]
      },
      {
        "text": "牡丹江市",
        "value": "231000",
        "children": [
          { "text": "东安区", "value": "231002" },
          { "text": "阳明区", "value": "231003" },
          { "text": "爱民区", "value": "231004" },
          { "text": "西安区", "value": "231005" },
          { "text": "林口县", "value": "231025" },
          { "text": "绥芬河市", "value": "231081" },
          { "text": "海林市", "value": "231083" },
          { "text": "宁安市", "value": "231084" },
          { "text": "穆棱市", "value": "231085" },
          { "text": "东宁市", "value": "231086" }
        ]
      },
      {
        "text": "黑河市",
        "value": "231100",
        "children": [
          { "text": "爱辉区", "value": "231102" },
          { "text": "逊克县", "value": "231123" },
          { "text": "孙吴县", "value": "231124" },
          { "text": "北安市", "value": "231181" },
          { "text": "五大连池市", "value": "231182" },
          { "text": "嫩江市", "value": "231183" }
        ]
      },
      {
        "text": "绥化市",
        "value": "231200",
        "children": [
          { "text": "北林区", "value": "231202" },
          { "text": "望奎县", "value": "231221" },
          { "text": "兰西县", "value": "231222" },
          { "text": "青冈县", "value": "231223" },
          { "text": "庆安县", "value": "231224" },
          { "text": "明水县", "value": "231225" },
          { "text": "绥棱县", "value": "231226" },
          { "text": "安达市", "value": "231281" },
          { "text": "肇东市", "value": "231282" },
          { "text": "海伦市", "value": "231283" }
        ]
      },
      {
        "text": "大兴安岭地区",
        "value": "232700",
        "children": [
          { "text": "漠河市", "value": "232701" },
          { "text": "呼玛县", "value": "232721" },
          { "text": "塔河县", "value": "232722" },
          { "text": "加格达奇区", "value": "232761" },
          { "text": "松岭区", "value": "232762" },
          { "text": "新林区", "value": "232763" },
          { "text": "呼中区", "value": "232764" }
        ]
      }
    ]
  },
  {
    "text": "上海市",
    "value": "310000",
    "children": [
      {
        "text": "上海市",
        "value": "310100",
        "children": [
          { "text": "黄浦区", "value": "310101" },
          { "text": "徐汇区", "value": "310104" },
          { "text": "长宁区", "value": "310105" },
          { "text": "静安区", "value": "310106" },
          { "text": "普陀区", "value": "310107" },
          { "text": "虹口区", "value": "310109" },
          { "text": "杨浦区", "value": "310110" },
          { "text": "闵行区", "value": "310112" },
          { "text": "宝山区", "value": "310113" },
          { "text": "嘉定区", "value": "310114" },
          { "text": "浦东新区", "value": "310115" },
          { "text": "金山区", "value": "310116" },
          { "text": "松江区", "value": "310117" },
          { "text": "青浦区", "value": "310118" },
          { "text": "奉贤区", "value": "310120" },
          { "text": "崇明区", "value": "310151" }
        ]
      }
    ]
  },
  {
    "text": "江苏省",
    "value": "320000",
    "children": [
      {
        "text": "南京市",
        "value": "320100",
        "children": [
          { "text": "玄武区", "value": "320102" },
          { "text": "秦淮区", "value": "320104" },
          { "text": "建邺区", "value": "320105" },
          { "text": "鼓楼区", "value": "320106" },
          { "text": "浦口区", "value": "320111" },
          { "text": "栖霞区", "value": "320113" },
          { "text": "雨花台区", "value": "320114" },
          { "text": "江宁区", "value": "320115" },
          { "text": "六合区", "value": "320116" },
          { "text": "溧水区", "value": "320117" },
          { "text": "高淳区", "value": "320118" }
        ]
      },
      {
        "text": "无锡市",
        "value": "320200",
        "children": [
          { "text": "锡山区", "value": "320205" },
          { "text": "惠山区", "value": "320206" },
          { "text": "滨湖区", "value": "320211" },
          { "text": "梁溪区", "value": "320213" },
          { "text": "新吴区", "value": "320214" },
          { "text": "江阴市", "value": "320281" },
          { "text": "宜兴市", "value": "320282" }
        ]
      },
      {
        "text": "徐州市",
        "value": "320300",
        "children": [
          { "text": "鼓楼区", "value": "320302" },
          { "text": "云龙区", "value": "320303" },
          { "text": "贾汪区", "value": "320305" },
          { "text": "泉山区", "value": "320311" },
          { "text": "铜山区", "value": "320312" },
          { "text": "丰县", "value": "320321" },
          { "text": "沛县", "value": "320322" },
          { "text": "睢宁县", "value": "320324" },
          { "text": "新沂市", "value": "320381" },
          { "text": "邳州市", "value": "320382" }
        ]
      },
      {
        "text": "常州市",
        "value": "320400",
        "children": [
          { "text": "天宁区", "value": "320402" },
          { "text": "钟楼区", "value": "320404" },
          { "text": "新北区", "value": "320411" },
          { "text": "武进区", "value": "320412" },
          { "text": "金坛区", "value": "320413" },
          { "text": "溧阳市", "value": "320481" }
        ]
      },
      {
        "text": "苏州市",
        "value": "320500",
        "children": [
          { "text": "虎丘区", "value": "320505" },
          { "text": "吴中区", "value": "320506" },
          { "text": "相城区", "value": "320507" },
          { "text": "姑苏区", "value": "320508" },
          { "text": "吴江区", "value": "320509" },
          { "text": "常熟市", "value": "320581" },
          { "text": "张家港市", "value": "320582" },
          { "text": "昆山市", "value": "320583" },
          { "text": "太仓市", "value": "320585" }
        ]
      },
      {
        "text": "南通市",
        "value": "320600",
        "children": [
          { "text": "崇川区", "value": "320602" },
          { "text": "通州区", "value": "320612" },
          { "text": "海门区", "value": "320613" },
          { "text": "海安市", "value": "320621" },
          { "text": "如东县", "value": "320623" },
          { "text": "启东市", "value": "320681" },
          { "text": "如皋市", "value": "320682" }
        ]
      },
      {
        "text": "连云港市",
        "value": "320700",
        "children": [
          { "text": "连云区", "value": "320703" },
          { "text": "海州区", "value": "320706" },
          { "text": "赣榆区", "value": "320707" },
          { "text": "东海县", "value": "320722" },
          { "text": "灌云县", "value": "320723" },
          { "text": "灌南县", "value": "320724" }
        ]
      },
      {
        "text": "淮安市",
        "value": "320800",
        "children": [
          { "text": "淮安区", "value": "320803" },
          { "text": "淮阴区", "value": "320804" },
          { "text": "清江浦区", "value": "320812" },
          { "text": "洪泽区", "value": "320813" },
          { "text": "涟水县", "value": "320826" },
          { "text": "盱眙县", "value": "320830" },
          { "text": "金湖县", "value": "320831" }
        ]
      },
      {
        "text": "盐城市",
        "value": "320900",
        "children": [
          { "text": "亭湖区", "value": "320902" },
          { "text": "盐都区", "value": "320903" },
          { "text": "大丰区", "value": "320904" },
          { "text": "响水县", "value": "320921" },
          { "text": "滨海县", "value": "320922" },
          { "text": "阜宁县", "value": "320923" },
          { "text": "射阳县", "value": "320924" },
          { "text": "建湖县", "value": "320925" },
          { "text": "东台市", "value": "320981" }
        ]
      },
      {
        "text": "扬州市",
        "value": "321000",
        "children": [
          { "text": "广陵区", "value": "321002" },
          { "text": "邗江区", "value": "321003" },
          { "text": "江都区", "value": "321012" },
          { "text": "宝应县", "value": "321023" },
          { "text": "仪征市", "value": "321081" },
          { "text": "高邮市", "value": "321084" }
        ]
      },
      {
        "text": "镇江市",
        "value": "321100",
        "children": [
          { "text": "京口区", "value": "321102" },
          { "text": "润州区", "value": "321111" },
          { "text": "丹徒区", "value": "321112" },
          { "text": "丹阳市", "value": "321181" },
          { "text": "扬中市", "value": "321182" },
          { "text": "句容市", "value": "321183" }
        ]
      },
      {
        "text": "泰州市",
        "value": "321200",
        "children": [
          { "text": "海陵区", "value": "321202" },
          { "text": "高港区", "value": "321203" },
          { "text": "姜堰区", "value": "321204" },
          { "text": "兴化市", "value": "321281" },
          { "text": "靖江市", "value": "321282" },
          { "text": "泰兴市", "value": "321283" }
        ]
      },
      {
        "text": "宿迁市",
        "value": "321300",
        "children": [
          { "text": "宿城区", "value": "321302" },
          { "text": "宿豫区", "value": "321311" },
          { "text": "沭阳县", "value": "321322" },
          { "text": "泗阳县", "value": "321323" },
          { "text": "泗洪县", "value": "321324" }
        ]
      }
    ]
  },
  {
    "text": "浙江省",
    "value": "330000",
    "children": [
      {
        "text": "杭州市",
        "value": "330100",
        "children": [
          { "text": "上城区", "value": "330102" },
          { "text": "下城区", "value": "330103" },
          { "text": "江干区", "value": "330104" },
          { "text": "拱墅区", "value": "330105" },
          { "text": "西湖区", "value": "330106" },
          { "text": "滨江区", "value": "330108" },
          { "text": "萧山区", "value": "330109" },
          { "text": "余杭区", "value": "330110" },
          { "text": "富阳区", "value": "330111" },
          { "text": "临安区", "value": "330112" },
          { "text": "桐庐县", "value": "330122" },
          { "text": "淳安县", "value": "330127" },
          { "text": "建德市", "value": "330182" }
        ]
      },
      {
        "text": "宁波市",
        "value": "330200",
        "children": [
          { "text": "海曙区", "value": "330203" },
          { "text": "江北区", "value": "330205" },
          { "text": "北仑区", "value": "330206" },
          { "text": "镇海区", "value": "330211" },
          { "text": "鄞州区", "value": "330212" },
          { "text": "奉化区", "value": "330213" },
          { "text": "象山县", "value": "330225" },
          { "text": "宁海县", "value": "330226" },
          { "text": "余姚市", "value": "330281" },
          { "text": "慈溪市", "value": "330282" }
        ]
      },
      {
        "text": "温州市",
        "value": "330300",
        "children": [
          { "text": "鹿城区", "value": "330302" },
          { "text": "龙湾区", "value": "330303" },
          { "text": "瓯海区", "value": "330304" },
          { "text": "洞头区", "value": "330305" },
          { "text": "永嘉县", "value": "330324" },
          { "text": "平阳县", "value": "330326" },
          { "text": "苍南县", "value": "330327" },
          { "text": "文成县", "value": "330328" },
          { "text": "泰顺县", "value": "330329" },
          { "text": "瑞安市", "value": "330381" },
          { "text": "乐清市", "value": "330382" },
          { "text": "龙港市", "value": "330383" }
        ]
      },
      {
        "text": "嘉兴市",
        "value": "330400",
        "children": [
          { "text": "南湖区", "value": "330402" },
          { "text": "秀洲区", "value": "330411" },
          { "text": "嘉善县", "value": "330421" },
          { "text": "海盐县", "value": "330424" },
          { "text": "海宁市", "value": "330481" },
          { "text": "平湖市", "value": "330482" },
          { "text": "桐乡市", "value": "330483" }
        ]
      },
      {
        "text": "湖州市",
        "value": "330500",
        "children": [
          { "text": "吴兴区", "value": "330502" },
          { "text": "南浔区", "value": "330503" },
          { "text": "德清县", "value": "330521" },
          { "text": "长兴县", "value": "330522" },
          { "text": "安吉县", "value": "330523" }
        ]
      },
      {
        "text": "绍兴市",
        "value": "330600",
        "children": [
          { "text": "越城区", "value": "330602" },
          { "text": "柯桥区", "value": "330603" },
          { "text": "上虞区", "value": "330604" },
          { "text": "新昌县", "value": "330624" },
          { "text": "诸暨市", "value": "330681" },
          { "text": "嵊州市", "value": "330683" }
        ]
      },
      {
        "text": "金华市",
        "value": "330700",
        "children": [
          { "text": "婺城区", "value": "330702" },
          { "text": "金东区", "value": "330703" },
          { "text": "武义县", "value": "330723" },
          { "text": "浦江县", "value": "330726" },
          { "text": "磐安县", "value": "330727" },
          { "text": "兰溪市", "value": "330781" },
          { "text": "义乌市", "value": "330782" },
          { "text": "东阳市", "value": "330783" },
          { "text": "永康市", "value": "330784" }
        ]
      },
      {
        "text": "衢州市",
        "value": "330800",
        "children": [
          { "text": "柯城区", "value": "330802" },
          { "text": "衢江区", "value": "330803" },
          { "text": "常山县", "value": "330822" },
          { "text": "开化县", "value": "330824" },
          { "text": "龙游县", "value": "330825" },
          { "text": "江山市", "value": "330881" }
        ]
      },
      {
        "text": "舟山市",
        "value": "330900",
        "children": [
          { "text": "定海区", "value": "330902" },
          { "text": "普陀区", "value": "330903" },
          { "text": "岱山县", "value": "330921" },
          { "text": "嵊泗县", "value": "330922" }
        ]
      },
      {
        "text": "台州市",
        "value": "331000",
        "children": [
          { "text": "椒江区", "value": "331002" },
          { "text": "黄岩区", "value": "331003" },
          { "text": "路桥区", "value": "331004" },
          { "text": "三门县", "value": "331022" },
          { "text": "天台县", "value": "331023" },
          { "text": "仙居县", "value": "331024" },
          { "text": "温岭市", "value": "331081" },
          { "text": "临海市", "value": "331082" },
          { "text": "玉环市", "value": "331083" }
        ]
      },
      {
        "text": "丽水市",
        "value": "331100",
        "children": [
          { "text": "莲都区", "value": "331102" },
          { "text": "青田县", "value": "331121" },
          { "text": "缙云县", "value": "331122" },
          { "text": "遂昌县", "value": "331123" },
          { "text": "松阳县", "value": "331124" },
          { "text": "云和县", "value": "331125" },
          { "text": "庆元县", "value": "331126" },
          { "text": "景宁畲族自治县", "value": "331127" },
          { "text": "龙泉市", "value": "331181" }
        ]
      }
    ]
  },
  {
    "text": "安徽省",
    "value": "340000",
    "children": [
      {
        "text": "合肥市",
        "value": "340100",
        "children": [
          { "text": "瑶海区", "value": "340102" },
          { "text": "庐阳区", "value": "340103" },
          { "text": "蜀山区", "value": "340104" },
          { "text": "包河区", "value": "340111" },
          { "text": "长丰县", "value": "340121" },
          { "text": "肥东县", "value": "340122" },
          { "text": "肥西县", "value": "340123" },
          { "text": "庐江县", "value": "340124" },
          { "text": "巢湖市", "value": "340181" }
        ]
      },
      {
        "text": "芜湖市",
        "value": "340200",
        "children": [
          { "text": "镜湖区", "value": "340202" },
          { "text": "弋江区", "value": "340203" },
          { "text": "鸠江区", "value": "340207" },
          { "text": "三山区", "value": "340208" },
          { "text": "芜湖县", "value": "340221" },
          { "text": "繁昌县", "value": "340222" },
          { "text": "南陵县", "value": "340223" },
          { "text": "无为市", "value": "340281" }
        ]
      },
      {
        "text": "蚌埠市",
        "value": "340300",
        "children": [
          { "text": "龙子湖区", "value": "340302" },
          { "text": "蚌山区", "value": "340303" },
          { "text": "禹会区", "value": "340304" },
          { "text": "淮上区", "value": "340311" },
          { "text": "怀远县", "value": "340321" },
          { "text": "五河县", "value": "340322" },
          { "text": "固镇县", "value": "340323" }
        ]
      },
      {
        "text": "淮南市",
        "value": "340400",
        "children": [
          { "text": "大通区", "value": "340402" },
          { "text": "田家庵区", "value": "340403" },
          { "text": "谢家集区", "value": "340404" },
          { "text": "八公山区", "value": "340405" },
          { "text": "潘集区", "value": "340406" },
          { "text": "凤台县", "value": "340421" },
          { "text": "寿县", "value": "340422" }
        ]
      },
      {
        "text": "马鞍山市",
        "value": "340500",
        "children": [
          { "text": "花山区", "value": "340503" },
          { "text": "雨山区", "value": "340504" },
          { "text": "博望区", "value": "340506" },
          { "text": "当涂县", "value": "340521" },
          { "text": "含山县", "value": "340522" },
          { "text": "和县", "value": "340523" }
        ]
      },
      {
        "text": "淮北市",
        "value": "340600",
        "children": [
          { "text": "杜集区", "value": "340602" },
          { "text": "相山区", "value": "340603" },
          { "text": "烈山区", "value": "340604" },
          { "text": "濉溪县", "value": "340621" }
        ]
      },
      {
        "text": "铜陵市",
        "value": "340700",
        "children": [
          { "text": "铜官区", "value": "340705" },
          { "text": "义安区", "value": "340706" },
          { "text": "郊区", "value": "340711" },
          { "text": "枞阳县", "value": "340722" }
        ]
      },
      {
        "text": "安庆市",
        "value": "340800",
        "children": [
          { "text": "迎江区", "value": "340802" },
          { "text": "大观区", "value": "340803" },
          { "text": "宜秀区", "value": "340811" },
          { "text": "怀宁县", "value": "340822" },
          { "text": "潜山市", "value": "340824" },
          { "text": "太湖县", "value": "340825" },
          { "text": "宿松县", "value": "340826" },
          { "text": "望江县", "value": "340827" },
          { "text": "岳西县", "value": "340828" },
          { "text": "桐城市", "value": "340881" }
        ]
      },
      {
        "text": "黄山市",
        "value": "341000",
        "children": [
          { "text": "屯溪区", "value": "341002" },
          { "text": "黄山区", "value": "341003" },
          { "text": "徽州区", "value": "341004" },
          { "text": "歙县", "value": "341021" },
          { "text": "休宁县", "value": "341022" },
          { "text": "黟县", "value": "341023" },
          { "text": "祁门县", "value": "341024" }
        ]
      },
      {
        "text": "滁州市",
        "value": "341100",
        "children": [
          { "text": "琅琊区", "value": "341102" },
          { "text": "南谯区", "value": "341103" },
          { "text": "来安县", "value": "341122" },
          { "text": "全椒县", "value": "341124" },
          { "text": "定远县", "value": "341125" },
          { "text": "凤阳县", "value": "341126" },
          { "text": "天长市", "value": "341181" },
          { "text": "明光市", "value": "341182" }
        ]
      },
      {
        "text": "阜阳市",
        "value": "341200",
        "children": [
          { "text": "颍州区", "value": "341202" },
          { "text": "颍东区", "value": "341203" },
          { "text": "颍泉区", "value": "341204" },
          { "text": "临泉县", "value": "341221" },
          { "text": "太和县", "value": "341222" },
          { "text": "阜南县", "value": "341225" },
          { "text": "颍上县", "value": "341226" },
          { "text": "界首市", "value": "341282" }
        ]
      },
      {
        "text": "宿州市",
        "value": "341300",
        "children": [
          { "text": "埇桥区", "value": "341302" },
          { "text": "砀山县", "value": "341321" },
          { "text": "萧县", "value": "341322" },
          { "text": "灵璧县", "value": "341323" },
          { "text": "泗县", "value": "341324" }
        ]
      },
      {
        "text": "六安市",
        "value": "341500",
        "children": [
          { "text": "金安区", "value": "341502" },
          { "text": "裕安区", "value": "341503" },
          { "text": "叶集区", "value": "341504" },
          { "text": "霍邱县", "value": "341522" },
          { "text": "舒城县", "value": "341523" },
          { "text": "金寨县", "value": "341524" },
          { "text": "霍山县", "value": "341525" }
        ]
      },
      {
        "text": "亳州市",
        "value": "341600",
        "children": [
          { "text": "谯城区", "value": "341602" },
          { "text": "涡阳县", "value": "341621" },
          { "text": "蒙城县", "value": "341622" },
          { "text": "利辛县", "value": "341623" }
        ]
      },
      {
        "text": "池州市",
        "value": "341700",
        "children": [
          { "text": "贵池区", "value": "341702" },
          { "text": "东至县", "value": "341721" },
          { "text": "石台县", "value": "341722" },
          { "text": "青阳县", "value": "341723" }
        ]
      },
      {
        "text": "宣城市",
        "value": "341800",
        "children": [
          { "text": "宣州区", "value": "341802" },
          { "text": "郎溪县", "value": "341821" },
          { "text": "广德市", "value": "341822" },
          { "text": "泾县", "value": "341823" },
          { "text": "绩溪县", "value": "341824" },
          { "text": "旌德县", "value": "341825" },
          { "text": "宁国市", "value": "341881" }
        ]
      }
    ]
  },
  {
    "text": "福建省",
    "value": "350000",
    "children": [
      {
        "text": "福州市",
        "value": "350100",
        "children": [
          { "text": "鼓楼区", "value": "350102" },
          { "text": "台江区", "value": "350103" },
          { "text": "仓山区", "value": "350104" },
          { "text": "马尾区", "value": "350105" },
          { "text": "晋安区", "value": "350111" },
          { "text": "长乐区", "value": "350112" },
          { "text": "闽侯县", "value": "350121" },
          { "text": "连江县", "value": "350122" },
          { "text": "罗源县", "value": "350123" },
          { "text": "闽清县", "value": "350124" },
          { "text": "永泰县", "value": "350125" },
          { "text": "平潭县", "value": "350128" },
          { "text": "福清市", "value": "350181" }
        ]
      },
      {
        "text": "厦门市",
        "value": "350200",
        "children": [
          { "text": "思明区", "value": "350203" },
          { "text": "海沧区", "value": "350205" },
          { "text": "湖里区", "value": "350206" },
          { "text": "集美区", "value": "350211" },
          { "text": "同安区", "value": "350212" },
          { "text": "翔安区", "value": "350213" }
        ]
      },
      {
        "text": "莆田市",
        "value": "350300",
        "children": [
          { "text": "城厢区", "value": "350302" },
          { "text": "涵江区", "value": "350303" },
          { "text": "荔城区", "value": "350304" },
          { "text": "秀屿区", "value": "350305" },
          { "text": "仙游县", "value": "350322" }
        ]
      },
      {
        "text": "三明市",
        "value": "350400",
        "children": [
          { "text": "梅列区", "value": "350402" },
          { "text": "三元区", "value": "350403" },
          { "text": "明溪县", "value": "350421" },
          { "text": "清流县", "value": "350423" },
          { "text": "宁化县", "value": "350424" },
          { "text": "大田县", "value": "350425" },
          { "text": "尤溪县", "value": "350426" },
          { "text": "沙县", "value": "350427" },
          { "text": "将乐县", "value": "350428" },
          { "text": "泰宁县", "value": "350429" },
          { "text": "建宁县", "value": "350430" },
          { "text": "永安市", "value": "350481" }
        ]
      },
      {
        "text": "泉州市",
        "value": "350500",
        "children": [
          { "text": "鲤城区", "value": "350502" },
          { "text": "丰泽区", "value": "350503" },
          { "text": "洛江区", "value": "350504" },
          { "text": "泉港区", "value": "350505" },
          { "text": "惠安县", "value": "350521" },
          { "text": "安溪县", "value": "350524" },
          { "text": "永春县", "value": "350525" },
          { "text": "德化县", "value": "350526" },
          { "text": "金门县", "value": "350527" },
          { "text": "石狮市", "value": "350581" },
          { "text": "晋江市", "value": "350582" },
          { "text": "南安市", "value": "350583" }
        ]
      },
      {
        "text": "漳州市",
        "value": "350600",
        "children": [
          { "text": "芗城区", "value": "350602" },
          { "text": "龙文区", "value": "350603" },
          { "text": "云霄县", "value": "350622" },
          { "text": "漳浦县", "value": "350623" },
          { "text": "诏安县", "value": "350624" },
          { "text": "长泰区", "value": "350625" },
          { "text": "东山县", "value": "350626" },
          { "text": "南靖县", "value": "350627" },
          { "text": "平和县", "value": "350628" },
          { "text": "华安县", "value": "350629" },
          { "text": "龙海区", "value": "350681" }
        ]
      },
      {
        "text": "南平市",
        "value": "350700",
        "children": [
          { "text": "延平区", "value": "350702" },
          { "text": "建阳区", "value": "350703" },
          { "text": "顺昌县", "value": "350721" },
          { "text": "浦城县", "value": "350722" },
          { "text": "光泽县", "value": "350723" },
          { "text": "松溪县", "value": "350724" },
          { "text": "政和县", "value": "350725" },
          { "text": "邵武市", "value": "350781" },
          { "text": "武夷山市", "value": "350782" },
          { "text": "建瓯市", "value": "350783" }
        ]
      },
      {
        "text": "龙岩市",
        "value": "350800",
        "children": [
          { "text": "新罗区", "value": "350802" },
          { "text": "永定区", "value": "350803" },
          { "text": "长汀县", "value": "350821" },
          { "text": "上杭县", "value": "350823" },
          { "text": "武平县", "value": "350824" },
          { "text": "连城县", "value": "350825" },
          { "text": "漳平市", "value": "350881" }
        ]
      },
      {
        "text": "宁德市",
        "value": "350900",
        "children": [
          { "text": "蕉城区", "value": "350902" },
          { "text": "霞浦县", "value": "350921" },
          { "text": "古田县", "value": "350922" },
          { "text": "屏南县", "value": "350923" },
          { "text": "寿宁县", "value": "350924" },
          { "text": "周宁县", "value": "350925" },
          { "text": "柘荣县", "value": "350926" },
          { "text": "福安市", "value": "350981" },
          { "text": "福鼎市", "value": "350982" }
        ]
      }
    ]
  },
  {
    "text": "江西省",
    "value": "360000",
    "children": [
      {
        "text": "南昌市",
        "value": "360100",
        "children": [
          { "text": "东湖区", "value": "360102" },
          { "text": "西湖区", "value": "360103" },
          { "text": "青云谱区", "value": "360104" },
          { "text": "湾里区", "value": "360105" },
          { "text": "青山湖区", "value": "360111" },
          { "text": "新建区", "value": "360112" },
          { "text": "南昌县", "value": "360121" },
          { "text": "安义县", "value": "360123" },
          { "text": "进贤县", "value": "360124" }
        ]
      },
      {
        "text": "景德镇市",
        "value": "360200",
        "children": [
          { "text": "昌江区", "value": "360202" },
          { "text": "珠山区", "value": "360203" },
          { "text": "浮梁县", "value": "360222" },
          { "text": "乐平市", "value": "360281" }
        ]
      },
      {
        "text": "萍乡市",
        "value": "360300",
        "children": [
          { "text": "安源区", "value": "360302" },
          { "text": "湘东区", "value": "360313" },
          { "text": "莲花县", "value": "360321" },
          { "text": "上栗县", "value": "360322" },
          { "text": "芦溪县", "value": "360323" }
        ]
      },
      {
        "text": "九江市",
        "value": "360400",
        "children": [
          { "text": "濂溪区", "value": "360402" },
          { "text": "浔阳区", "value": "360403" },
          { "text": "柴桑区", "value": "360404" },
          { "text": "武宁县", "value": "360423" },
          { "text": "修水县", "value": "360424" },
          { "text": "永修县", "value": "360425" },
          { "text": "德安县", "value": "360426" },
          { "text": "都昌县", "value": "360428" },
          { "text": "湖口县", "value": "360429" },
          { "text": "彭泽县", "value": "360430" },
          { "text": "瑞昌市", "value": "360481" },
          { "text": "共青城市", "value": "360482" },
          { "text": "庐山市", "value": "360483" }
        ]
      },
      {
        "text": "新余市",
        "value": "360500",
        "children": [
          { "text": "渝水区", "value": "360502" },
          { "text": "分宜县", "value": "360521" }
        ]
      },
      {
        "text": "鹰潭市",
        "value": "360600",
        "children": [
          { "text": "月湖区", "value": "360602" },
          { "text": "余江区", "value": "360603" },
          { "text": "贵溪市", "value": "360681" }
        ]
      },
      {
        "text": "赣州市",
        "value": "360700",
        "children": [
          { "text": "章贡区", "value": "360702" },
          { "text": "南康区", "value": "360703" },
          { "text": "赣县区", "value": "360704" },
          { "text": "信丰县", "value": "360722" },
          { "text": "大余县", "value": "360723" },
          { "text": "上犹县", "value": "360724" },
          { "text": "崇义县", "value": "360725" },
          { "text": "安远县", "value": "360726" },
          { "text": "龙南市", "value": "360727" },
          { "text": "定南县", "value": "360728" },
          { "text": "全南县", "value": "360729" },
          { "text": "宁都县", "value": "360730" },
          { "text": "于都县", "value": "360731" },
          { "text": "兴国县", "value": "360732" },
          { "text": "会昌县", "value": "360733" },
          { "text": "寻乌县", "value": "360734" },
          { "text": "石城县", "value": "360735" },
          { "text": "瑞金市", "value": "360781" }
        ]
      },
      {
        "text": "吉安市",
        "value": "360800",
        "children": [
          { "text": "吉州区", "value": "360802" },
          { "text": "青原区", "value": "360803" },
          { "text": "吉安县", "value": "360821" },
          { "text": "吉水县", "value": "360822" },
          { "text": "峡江县", "value": "360823" },
          { "text": "新干县", "value": "360824" },
          { "text": "永丰县", "value": "360825" },
          { "text": "泰和县", "value": "360826" },
          { "text": "遂川县", "value": "360827" },
          { "text": "万安县", "value": "360828" },
          { "text": "安福县", "value": "360829" },
          { "text": "永新县", "value": "360830" },
          { "text": "井冈山市", "value": "360881" }
        ]
      },
      {
        "text": "宜春市",
        "value": "360900",
        "children": [
          { "text": "袁州区", "value": "360902" },
          { "text": "奉新县", "value": "360921" },
          { "text": "万载县", "value": "360922" },
          { "text": "上高县", "value": "360923" },
          { "text": "宜丰县", "value": "360924" },
          { "text": "靖安县", "value": "360925" },
          { "text": "铜鼓县", "value": "360926" },
          { "text": "丰城市", "value": "360981" },
          { "text": "樟树市", "value": "360982" },
          { "text": "高安市", "value": "360983" }
        ]
      },
      {
        "text": "抚州市",
        "value": "361000",
        "children": [
          { "text": "临川区", "value": "361002" },
          { "text": "东乡区", "value": "361003" },
          { "text": "南城县", "value": "361021" },
          { "text": "黎川县", "value": "361022" },
          { "text": "南丰县", "value": "361023" },
          { "text": "崇仁县", "value": "361024" },
          { "text": "乐安县", "value": "361025" },
          { "text": "宜黄县", "value": "361026" },
          { "text": "金溪县", "value": "361027" },
          { "text": "资溪县", "value": "361028" },
          { "text": "广昌县", "value": "361030" }
        ]
      },
      {
        "text": "上饶市",
        "value": "361100",
        "children": [
          { "text": "信州区", "value": "361102" },
          { "text": "广丰区", "value": "361103" },
          { "text": "广信区", "value": "361104" },
          { "text": "玉山县", "value": "361123" },
          { "text": "铅山县", "value": "361124" },
          { "text": "横峰县", "value": "361125" },
          { "text": "弋阳县", "value": "361126" },
          { "text": "余干县", "value": "361127" },
          { "text": "鄱阳县", "value": "361128" },
          { "text": "万年县", "value": "361129" },
          { "text": "婺源县", "value": "361130" },
          { "text": "德兴市", "value": "361181" }
        ]
      }
    ]
  },
  {
    "text": "山东省",
    "value": "370000",
    "children": [
      {
        "text": "济南市",
        "value": "370100",
        "children": [
          { "text": "历下区", "value": "370102" },
          { "text": "市中区", "value": "370103" },
          { "text": "槐荫区", "value": "370104" },
          { "text": "天桥区", "value": "370105" },
          { "text": "历城区", "value": "370112" },
          { "text": "长清区", "value": "370113" },
          { "text": "章丘区", "value": "370114" },
          { "text": "济阳区", "value": "370115" },
          { "text": "莱芜区", "value": "370116" },
          { "text": "钢城区", "value": "370117" },
          { "text": "平阴县", "value": "370124" },
          { "text": "商河县", "value": "370126" }
        ]
      },
      {
        "text": "青岛市",
        "value": "370200",
        "children": [
          { "text": "市南区", "value": "370202" },
          { "text": "市北区", "value": "370203" },
          { "text": "黄岛区", "value": "370211" },
          { "text": "崂山区", "value": "370212" },
          { "text": "李沧区", "value": "370213" },
          { "text": "城阳区", "value": "370214" },
          { "text": "即墨区", "value": "370215" },
          { "text": "胶州市", "value": "370281" },
          { "text": "平度市", "value": "370283" },
          { "text": "莱西市", "value": "370285" }
        ]
      },
      {
        "text": "淄博市",
        "value": "370300",
        "children": [
          { "text": "淄川区", "value": "370302" },
          { "text": "张店区", "value": "370303" },
          { "text": "博山区", "value": "370304" },
          { "text": "临淄区", "value": "370305" },
          { "text": "周村区", "value": "370306" },
          { "text": "桓台县", "value": "370321" },
          { "text": "高青县", "value": "370322" },
          { "text": "沂源县", "value": "370323" }
        ]
      },
      {
        "text": "枣庄市",
        "value": "370400",
        "children": [
          { "text": "市中区", "value": "370402" },
          { "text": "薛城区", "value": "370403" },
          { "text": "峄城区", "value": "370404" },
          { "text": "台儿庄区", "value": "370405" },
          { "text": "山亭区", "value": "370406" },
          { "text": "滕州市", "value": "370481" }
        ]
      },
      {
        "text": "东营市",
        "value": "370500",
        "children": [
          { "text": "东营区", "value": "370502" },
          { "text": "河口区", "value": "370503" },
          { "text": "垦利区", "value": "370505" },
          { "text": "利津县", "value": "370522" },
          { "text": "广饶县", "value": "370523" }
        ]
      },
      {
        "text": "烟台市",
        "value": "370600",
        "children": [
          { "text": "芝罘区", "value": "370602" },
          { "text": "福山区", "value": "370611" },
          { "text": "牟平区", "value": "370612" },
          { "text": "莱山区", "value": "370613" },
          { "text": "长岛县", "value": "370634" },
          { "text": "龙口市", "value": "370681" },
          { "text": "莱阳市", "value": "370682" },
          { "text": "莱州市", "value": "370683" },
          { "text": "蓬莱区", "value": "370684" },
          { "text": "招远市", "value": "370685" },
          { "text": "栖霞市", "value": "370686" },
          { "text": "海阳市", "value": "370687" }
        ]
      },
      {
        "text": "潍坊市",
        "value": "370700",
        "children": [
          { "text": "潍城区", "value": "370702" },
          { "text": "寒亭区", "value": "370703" },
          { "text": "坊子区", "value": "370704" },
          { "text": "奎文区", "value": "370705" },
          { "text": "临朐县", "value": "370724" },
          { "text": "昌乐县", "value": "370725" },
          { "text": "青州市", "value": "370781" },
          { "text": "诸城市", "value": "370782" },
          { "text": "寿光市", "value": "370783" },
          { "text": "安丘市", "value": "370784" },
          { "text": "高密市", "value": "370785" },
          { "text": "昌邑市", "value": "370786" }
        ]
      },
      {
        "text": "济宁市",
        "value": "370800",
        "children": [
          { "text": "任城区", "value": "370811" },
          { "text": "兖州区", "value": "370812" },
          { "text": "微山县", "value": "370826" },
          { "text": "鱼台县", "value": "370827" },
          { "text": "金乡县", "value": "370828" },
          { "text": "嘉祥县", "value": "370829" },
          { "text": "汶上县", "value": "370830" },
          { "text": "泗水县", "value": "370831" },
          { "text": "梁山县", "value": "370832" },
          { "text": "曲阜市", "value": "370881" },
          { "text": "邹城市", "value": "370883" }
        ]
      },
      {
        "text": "泰安市",
        "value": "370900",
        "children": [
          { "text": "泰山区", "value": "370902" },
          { "text": "岱岳区", "value": "370911" },
          { "text": "宁阳县", "value": "370921" },
          { "text": "东平县", "value": "370923" },
          { "text": "新泰市", "value": "370982" },
          { "text": "肥城市", "value": "370983" }
        ]
      },
      {
        "text": "威海市",
        "value": "371000",
        "children": [
          { "text": "环翠区", "value": "371002" },
          { "text": "文登区", "value": "371003" },
          { "text": "荣成市", "value": "371082" },
          { "text": "乳山市", "value": "371083" }
        ]
      },
      {
        "text": "日照市",
        "value": "371100",
        "children": [
          { "text": "东港区", "value": "371102" },
          { "text": "岚山区", "value": "371103" },
          { "text": "五莲县", "value": "371121" },
          { "text": "莒县", "value": "371122" }
        ]
      },
      {
        "text": "临沂市",
        "value": "371300",
        "children": [
          { "text": "兰山区", "value": "371302" },
          { "text": "罗庄区", "value": "371311" },
          { "text": "河东区", "value": "371312" },
          { "text": "沂南县", "value": "371321" },
          { "text": "郯城县", "value": "371322" },
          { "text": "沂水县", "value": "371323" },
          { "text": "兰陵县", "value": "371324" },
          { "text": "费县", "value": "371325" },
          { "text": "平邑县", "value": "371326" },
          { "text": "莒南县", "value": "371327" },
          { "text": "蒙阴县", "value": "371328" },
          { "text": "临沭县", "value": "371329" }
        ]
      },
      {
        "text": "德州市",
        "value": "371400",
        "children": [
          { "text": "德城区", "value": "371402" },
          { "text": "陵城区", "value": "371403" },
          { "text": "宁津县", "value": "371422" },
          { "text": "庆云县", "value": "371423" },
          { "text": "临邑县", "value": "371424" },
          { "text": "齐河县", "value": "371425" },
          { "text": "平原县", "value": "371426" },
          { "text": "夏津县", "value": "371427" },
          { "text": "武城县", "value": "371428" },
          { "text": "乐陵市", "value": "371481" },
          { "text": "禹城市", "value": "371482" }
        ]
      },
      {
        "text": "聊城市",
        "value": "371500",
        "children": [
          { "text": "东昌府区", "value": "371502" },
          { "text": "茌平区", "value": "371503" },
          { "text": "阳谷县", "value": "371521" },
          { "text": "莘县", "value": "371522" },
          { "text": "东阿县", "value": "371524" },
          { "text": "冠县", "value": "371525" },
          { "text": "高唐县", "value": "371526" },
          { "text": "临清市", "value": "371581" }
        ]
      },
      {
        "text": "滨州市",
        "value": "371600",
        "children": [
          { "text": "滨城区", "value": "371602" },
          { "text": "沾化区", "value": "371603" },
          { "text": "惠民县", "value": "371621" },
          { "text": "阳信县", "value": "371622" },
          { "text": "无棣县", "value": "371623" },
          { "text": "博兴县", "value": "371625" },
          { "text": "邹平市", "value": "371681" }
        ]
      },
      {
        "text": "菏泽市",
        "value": "371700",
        "children": [
          { "text": "牡丹区", "value": "371702" },
          { "text": "定陶区", "value": "371703" },
          { "text": "曹县", "value": "371721" },
          { "text": "单县", "value": "371722" },
          { "text": "成武县", "value": "371723" },
          { "text": "巨野县", "value": "371724" },
          { "text": "郓城县", "value": "371725" },
          { "text": "鄄城县", "value": "371726" },
          { "text": "东明县", "value": "371728" }
        ]
      }
    ]
  },
  {
    "text": "河南省",
    "value": "410000",
    "children": [
      {
        "text": "郑州市",
        "value": "410100",
        "children": [
          { "text": "中原区", "value": "410102" },
          { "text": "二七区", "value": "410103" },
          { "text": "管城回族区", "value": "410104" },
          { "text": "金水区", "value": "410105" },
          { "text": "上街区", "value": "410106" },
          { "text": "惠济区", "value": "410108" },
          { "text": "中牟县", "value": "410122" },
          { "text": "巩义市", "value": "410181" },
          { "text": "荥阳市", "value": "410182" },
          { "text": "新密市", "value": "410183" },
          { "text": "新郑市", "value": "410184" },
          { "text": "登封市", "value": "410185" }
        ]
      },
      {
        "text": "开封市",
        "value": "410200",
        "children": [
          { "text": "龙亭区", "value": "410202" },
          { "text": "顺河回族区", "value": "410203" },
          { "text": "鼓楼区", "value": "410204" },
          { "text": "禹王台区", "value": "410205" },
          { "text": "祥符区", "value": "410212" },
          { "text": "杞县", "value": "410221" },
          { "text": "通许县", "value": "410222" },
          { "text": "尉氏县", "value": "410223" },
          { "text": "兰考县", "value": "410225" }
        ]
      },
      {
        "text": "洛阳市",
        "value": "410300",
        "children": [
          { "text": "老城区", "value": "410302" },
          { "text": "西工区", "value": "410303" },
          { "text": "瀍河回族区", "value": "410304" },
          { "text": "涧西区", "value": "410305" },
          { "text": "吉利区", "value": "410306" },
          { "text": "洛龙区", "value": "410311" },
          { "text": "孟津县", "value": "410322" },
          { "text": "新安县", "value": "410323" },
          { "text": "栾川县", "value": "410324" },
          { "text": "嵩县", "value": "410325" },
          { "text": "汝阳县", "value": "410326" },
          { "text": "宜阳县", "value": "410327" },
          { "text": "洛宁县", "value": "410328" },
          { "text": "伊川县", "value": "410329" },
          { "text": "偃师市", "value": "410381" }
        ]
      },
      {
        "text": "平顶山市",
        "value": "410400",
        "children": [
          { "text": "新华区", "value": "410402" },
          { "text": "卫东区", "value": "410403" },
          { "text": "石龙区", "value": "410404" },
          { "text": "湛河区", "value": "410411" },
          { "text": "宝丰县", "value": "410421" },
          { "text": "叶县", "value": "410422" },
          { "text": "鲁山县", "value": "410423" },
          { "text": "郏县", "value": "410425" },
          { "text": "舞钢市", "value": "410481" },
          { "text": "汝州市", "value": "410482" }
        ]
      },
      {
        "text": "安阳市",
        "value": "410500",
        "children": [
          { "text": "文峰区", "value": "410502" },
          { "text": "北关区", "value": "410503" },
          { "text": "殷都区", "value": "410505" },
          { "text": "龙安区", "value": "410506" },
          { "text": "安阳县", "value": "410522" },
          { "text": "汤阴县", "value": "410523" },
          { "text": "滑县", "value": "410526" },
          { "text": "内黄县", "value": "410527" },
          { "text": "林州市", "value": "410581" }
        ]
      },
      {
        "text": "鹤壁市",
        "value": "410600",
        "children": [
          { "text": "鹤山区", "value": "410602" },
          { "text": "山城区", "value": "410603" },
          { "text": "淇滨区", "value": "410611" },
          { "text": "浚县", "value": "410621" },
          { "text": "淇县", "value": "410622" }
        ]
      },
      {
        "text": "新乡市",
        "value": "410700",
        "children": [
          { "text": "红旗区", "value": "410702" },
          { "text": "卫滨区", "value": "410703" },
          { "text": "凤泉区", "value": "410704" },
          { "text": "牧野区", "value": "410711" },
          { "text": "新乡县", "value": "410721" },
          { "text": "获嘉县", "value": "410724" },
          { "text": "原阳县", "value": "410725" },
          { "text": "延津县", "value": "410726" },
          { "text": "封丘县", "value": "410727" },
          { "text": "长垣市", "value": "410728" },
          { "text": "卫辉市", "value": "410781" },
          { "text": "辉县市", "value": "410782" }
        ]
      },
      {
        "text": "焦作市",
        "value": "410800",
        "children": [
          { "text": "解放区", "value": "410802" },
          { "text": "中站区", "value": "410803" },
          { "text": "马村区", "value": "410804" },
          { "text": "山阳区", "value": "410811" },
          { "text": "修武县", "value": "410821" },
          { "text": "博爱县", "value": "410822" },
          { "text": "武陟县", "value": "410823" },
          { "text": "温县", "value": "410825" },
          { "text": "沁阳市", "value": "410882" },
          { "text": "孟州市", "value": "410883" }
        ]
      },
      {
        "text": "濮阳市",
        "value": "410900",
        "children": [
          { "text": "华龙区", "value": "410902" },
          { "text": "清丰县", "value": "410922" },
          { "text": "南乐县", "value": "410923" },
          { "text": "范县", "value": "410926" },
          { "text": "台前县", "value": "410927" },
          { "text": "濮阳县", "value": "410928" }
        ]
      },
      {
        "text": "许昌市",
        "value": "411000",
        "children": [
          { "text": "魏都区", "value": "411002" },
          { "text": "建安区", "value": "411003" },
          { "text": "鄢陵县", "value": "411024" },
          { "text": "襄城县", "value": "411025" },
          { "text": "禹州市", "value": "411081" },
          { "text": "长葛市", "value": "411082" }
        ]
      },
      {
        "text": "漯河市",
        "value": "411100",
        "children": [
          { "text": "源汇区", "value": "411102" },
          { "text": "郾城区", "value": "411103" },
          { "text": "召陵区", "value": "411104" },
          { "text": "舞阳县", "value": "411121" },
          { "text": "临颍县", "value": "411122" }
        ]
      },
      {
        "text": "三门峡市",
        "value": "411200",
        "children": [
          { "text": "湖滨区", "value": "411202" },
          { "text": "陕州区", "value": "411203" },
          { "text": "渑池县", "value": "411221" },
          { "text": "卢氏县", "value": "411224" },
          { "text": "义马市", "value": "411281" },
          { "text": "灵宝市", "value": "411282" }
        ]
      },
      {
        "text": "南阳市",
        "value": "411300",
        "children": [
          { "text": "宛城区", "value": "411302" },
          { "text": "卧龙区", "value": "411303" },
          { "text": "南召县", "value": "411321" },
          { "text": "方城县", "value": "411322" },
          { "text": "西峡县", "value": "411323" },
          { "text": "镇平县", "value": "411324" },
          { "text": "内乡县", "value": "411325" },
          { "text": "淅川县", "value": "411326" },
          { "text": "社旗县", "value": "411327" },
          { "text": "唐河县", "value": "411328" },
          { "text": "新野县", "value": "411329" },
          { "text": "桐柏县", "value": "411330" },
          { "text": "邓州市", "value": "411381" }
        ]
      },
      {
        "text": "商丘市",
        "value": "411400",
        "children": [
          { "text": "梁园区", "value": "411402" },
          { "text": "睢阳区", "value": "411403" },
          { "text": "民权县", "value": "411421" },
          { "text": "睢县", "value": "411422" },
          { "text": "宁陵县", "value": "411423" },
          { "text": "柘城县", "value": "411424" },
          { "text": "虞城县", "value": "411425" },
          { "text": "夏邑县", "value": "411426" },
          { "text": "永城市", "value": "411481" }
        ]
      },
      {
        "text": "信阳市",
        "value": "411500",
        "children": [
          { "text": "浉河区", "value": "411502" },
          { "text": "平桥区", "value": "411503" },
          { "text": "罗山县", "value": "411521" },
          { "text": "光山县", "value": "411522" },
          { "text": "新县", "value": "411523" },
          { "text": "商城县", "value": "411524" },
          { "text": "固始县", "value": "411525" },
          { "text": "潢川县", "value": "411526" },
          { "text": "淮滨县", "value": "411527" },
          { "text": "息县", "value": "411528" }
        ]
      },
      {
        "text": "周口市",
        "value": "411600",
        "children": [
          { "text": "川汇区", "value": "411602" },
          { "text": "淮阳区", "value": "411603" },
          { "text": "扶沟县", "value": "411621" },
          { "text": "西华县", "value": "411622" },
          { "text": "商水县", "value": "411623" },
          { "text": "沈丘县", "value": "411624" },
          { "text": "郸城县", "value": "411625" },
          { "text": "太康县", "value": "411627" },
          { "text": "鹿邑县", "value": "411628" },
          { "text": "项城市", "value": "411681" }
        ]
      },
      {
        "text": "驻马店市",
        "value": "411700",
        "children": [
          { "text": "驿城区", "value": "411702" },
          { "text": "西平县", "value": "411721" },
          { "text": "上蔡县", "value": "411722" },
          { "text": "平舆县", "value": "411723" },
          { "text": "正阳县", "value": "411724" },
          { "text": "确山县", "value": "411725" },
          { "text": "泌阳县", "value": "411726" },
          { "text": "汝南县", "value": "411727" },
          { "text": "遂平县", "value": "411728" },
          { "text": "新蔡县", "value": "411729" }
        ]
      },
      {
        "text": "济源市",
        "value": "419001",
        "children": [
          { "text": "济源市", "value": "419001" }
        ]
      }
    ]
  },
  {
    "text": "湖北省",
    "value": "420000",
    "children": [
      {
        "text": "武汉市",
        "value": "420100",
        "children": [
          { "text": "江岸区", "value": "420102" },
          { "text": "江汉区", "value": "420103" },
          { "text": "硚口区", "value": "420104" },
          { "text": "汉阳区", "value": "420105" },
          { "text": "武昌区", "value": "420106" },
          { "text": "青山区", "value": "420107" },
          { "text": "洪山区", "value": "420111" },
          { "text": "东西湖区", "value": "420112" },
          { "text": "汉南区", "value": "420113" },
          { "text": "蔡甸区", "value": "420114" },
          { "text": "江夏区", "value": "420115" },
          { "text": "黄陂区", "value": "420116" },
          { "text": "新洲区", "value": "420117" }
        ]
      },
      {
        "text": "黄石市",
        "value": "420200",
        "children": [
          { "text": "黄石港区", "value": "420202" },
          { "text": "西塞山区", "value": "420203" },
          { "text": "下陆区", "value": "420204" },
          { "text": "铁山区", "value": "420205" },
          { "text": "阳新县", "value": "420222" },
          { "text": "大冶市", "value": "420281" }
        ]
      },
      {
        "text": "十堰市",
        "value": "420300",
        "children": [
          { "text": "茅箭区", "value": "420302" },
          { "text": "张湾区", "value": "420303" },
          { "text": "郧阳区", "value": "420304" },
          { "text": "郧西县", "value": "420322" },
          { "text": "竹山县", "value": "420323" },
          { "text": "竹溪县", "value": "420324" },
          { "text": "房县", "value": "420325" },
          { "text": "丹江口市", "value": "420381" }
        ]
      },
      {
        "text": "宜昌市",
        "value": "420500",
        "children": [
          { "text": "西陵区", "value": "420502" },
          { "text": "伍家岗区", "value": "420503" },
          { "text": "点军区", "value": "420504" },
          { "text": "猇亭区", "value": "420505" },
          { "text": "夷陵区", "value": "420506" },
          { "text": "远安县", "value": "420525" },
          { "text": "兴山县", "value": "420526" },
          { "text": "秭归县", "value": "420527" },
          { "text": "长阳土家族自治县", "value": "420528" },
          { "text": "五峰土家族自治县", "value": "420529" },
          { "text": "宜都市", "value": "420581" },
          { "text": "当阳市", "value": "420582" },
          { "text": "枝江市", "value": "420583" }
        ]
      },
      {
        "text": "襄阳市",
        "value": "420600",
        "children": [
          { "text": "襄城区", "value": "420602" },
          { "text": "樊城区", "value": "420606" },
          { "text": "襄州区", "value": "420607" },
          { "text": "南漳县", "value": "420624" },
          { "text": "谷城县", "value": "420625" },
          { "text": "保康县", "value": "420626" },
          { "text": "老河口市", "value": "420682" },
          { "text": "枣阳市", "value": "420683" },
          { "text": "宜城市", "value": "420684" }
        ]
      },
      {
        "text": "鄂州市",
        "value": "420700",
        "children": [
          { "text": "梁子湖区", "value": "420702" },
          { "text": "华容区", "value": "420703" },
          { "text": "鄂城区", "value": "420704" }
        ]
      },
      {
        "text": "荆门市",
        "value": "420800",
        "children": [
          { "text": "东宝区", "value": "420802" },
          { "text": "掇刀区", "value": "420804" },
          { "text": "沙洋县", "value": "420822" },
          { "text": "钟祥市", "value": "420881" },
          { "text": "京山市", "value": "420882" }
        ]
      },
      {
        "text": "孝感市",
        "value": "420900",
        "children": [
          { "text": "孝南区", "value": "420902" },
          { "text": "孝昌县", "value": "420921" },
          { "text": "大悟县", "value": "420922" },
          { "text": "云梦县", "value": "420923" },
          { "text": "应城市", "value": "420981" },
          { "text": "安陆市", "value": "420982" },
          { "text": "汉川市", "value": "420984" }
        ]
      },
      {
        "text": "荆州市",
        "value": "421000",
        "children": [
          { "text": "沙市区", "value": "421002" },
          { "text": "荆州区", "value": "421003" },
          { "text": "公安县", "value": "421022" },
          { "text": "监利市", "value": "421023" },
          { "text": "江陵县", "value": "421024" },
          { "text": "石首市", "value": "421081" },
          { "text": "洪湖市", "value": "421083" },
          { "text": "松滋市", "value": "421087" }
        ]
      },
      {
        "text": "黄冈市",
        "value": "421100",
        "children": [
          { "text": "黄州区", "value": "421102" },
          { "text": "团风县", "value": "421121" },
          { "text": "红安县", "value": "421122" },
          { "text": "罗田县", "value": "421123" },
          { "text": "英山县", "value": "421124" },
          { "text": "浠水县", "value": "421125" },
          { "text": "蕲春县", "value": "421126" },
          { "text": "黄梅县", "value": "421127" },
          { "text": "麻城市", "value": "421181" },
          { "text": "武穴市", "value": "421182" }
        ]
      },
      {
        "text": "咸宁市",
        "value": "421200",
        "children": [
          { "text": "咸安区", "value": "421202" },
          { "text": "嘉鱼县", "value": "421221" },
          { "text": "通城县", "value": "421222" },
          { "text": "崇阳县", "value": "421223" },
          { "text": "通山县", "value": "421224" },
          { "text": "赤壁市", "value": "421281" }
        ]
      },
      {
        "text": "随州市",
        "value": "421300",
        "children": [
          { "text": "曾都区", "value": "421303" },
          { "text": "随县", "value": "421321" },
          { "text": "广水市", "value": "421381" }
        ]
      },
      {
        "text": "恩施土家族苗族自治州",
        "value": "422800",
        "children": [
          { "text": "恩施市", "value": "422801" },
          { "text": "利川市", "value": "422802" },
          { "text": "建始县", "value": "422822" },
          { "text": "巴东县", "value": "422823" },
          { "text": "宣恩县", "value": "422825" },
          { "text": "咸丰县", "value": "422826" },
          { "text": "来凤县", "value": "422827" },
          { "text": "鹤峰县", "value": "422828" }
        ]
      },
      {
        "text": "省直辖县级行政区划",
        "value": "429000",
        "children": [
          { "text": "仙桃市", "value": "429004" },
          { "text": "潜江市", "value": "429005" },
          { "text": "天门市", "value": "429006" },
          { "text": "神农架林区", "value": "429021" }
        ]
      }
    ]
  },
  {
    "text": "湖南省",
    "value": "430000",
    "children": [
      {
        "text": "长沙市",
        "value": "430100",
        "children": [
          { "text": "芙蓉区", "value": "430102" },
          { "text": "天心区", "value": "430103" },
          { "text": "岳麓区", "value": "430104" },
          { "text": "开福区", "value": "430105" },
          { "text": "雨花区", "value": "430111" },
          { "text": "望城区", "value": "430112" },
          { "text": "长沙县", "value": "430121" },
          { "text": "浏阳市", "value": "430181" },
          { "text": "宁乡市", "value": "430182" }
        ]
      },
      {
        "text": "株洲市",
        "value": "430200",
        "children": [
          { "text": "荷塘区", "value": "430202" },
          { "text": "芦淞区", "value": "430203" },
          { "text": "石峰区", "value": "430204" },
          { "text": "天元区", "value": "430211" },
          { "text": "渌口区", "value": "430212" },
          { "text": "攸县", "value": "430223" },
          { "text": "茶陵县", "value": "430224" },
          { "text": "炎陵县", "value": "430225" },
          { "text": "醴陵市", "value": "430281" }
        ]
      },
      {
        "text": "湘潭市",
        "value": "430300",
        "children": [
          { "text": "雨湖区", "value": "430302" },
          { "text": "岳塘区", "value": "430304" },
          { "text": "湘潭县", "value": "430321" },
          { "text": "湘乡市", "value": "430381" },
          { "text": "韶山市", "value": "430382" }
        ]
      },
      {
        "text": "衡阳市",
        "value": "430400",
        "children": [
          { "text": "珠晖区", "value": "430405" },
          { "text": "雁峰区", "value": "430406" },
          { "text": "石鼓区", "value": "430407" },
          { "text": "蒸湘区", "value": "430408" },
          { "text": "南岳区", "value": "430412" },
          { "text": "衡阳县", "value": "430421" },
          { "text": "衡南县", "value": "430422" },
          { "text": "衡山县", "value": "430423" },
          { "text": "衡东县", "value": "430424" },
          { "text": "祁东县", "value": "430426" },
          { "text": "耒阳市", "value": "430481" },
          { "text": "常宁市", "value": "430482" }
        ]
      },
      {
        "text": "邵阳市",
        "value": "430500",
        "children": [
          { "text": "双清区", "value": "430502" },
          { "text": "大祥区", "value": "430503" },
          { "text": "北塔区", "value": "430511" },
          { "text": "邵东市", "value": "430521" },
          { "text": "新邵县", "value": "430522" },
          { "text": "邵阳县", "value": "430523" },
          { "text": "隆回县", "value": "430524" },
          { "text": "洞口县", "value": "430525" },
          { "text": "绥宁县", "value": "430527" },
          { "text": "新宁县", "value": "430528" },
          { "text": "城步苗族自治县", "value": "430529" },
          { "text": "武冈市", "value": "430581" }
        ]
      },
      {
        "text": "岳阳市",
        "value": "430600",
        "children": [
          { "text": "岳阳楼区", "value": "430602" },
          { "text": "云溪区", "value": "430603" },
          { "text": "君山区", "value": "430611" },
          { "text": "岳阳县", "value": "430621" },
          { "text": "华容县", "value": "430623" },
          { "text": "湘阴县", "value": "430624" },
          { "text": "平江县", "value": "430626" },
          { "text": "汨罗市", "value": "430681" },
          { "text": "临湘市", "value": "430682" }
        ]
      },
      {
        "text": "常德市",
        "value": "430700",
        "children": [
          { "text": "武陵区", "value": "430702" },
          { "text": "鼎城区", "value": "430703" },
          { "text": "安乡县", "value": "430721" },
          { "text": "汉寿县", "value": "430722" },
          { "text": "澧县", "value": "430723" },
          { "text": "临澧县", "value": "430724" },
          { "text": "桃源县", "value": "430725" },
          { "text": "石门县", "value": "430726" },
          { "text": "津市市", "value": "430781" }
        ]
      },
      {
        "text": "张家界市",
        "value": "430800",
        "children": [
          { "text": "永定区", "value": "430802" },
          { "text": "武陵源区", "value": "430811" },
          { "text": "慈利县", "value": "430821" },
          { "text": "桑植县", "value": "430822" }
        ]
      },
      {
        "text": "益阳市",
        "value": "430900",
        "children": [
          { "text": "资阳区", "value": "430902" },
          { "text": "赫山区", "value": "430903" },
          { "text": "南县", "value": "430921" },
          { "text": "桃江县", "value": "430922" },
          { "text": "安化县", "value": "430923" },
          { "text": "沅江市", "value": "430981" }
        ]
      },
      {
        "text": "郴州市",
        "value": "431000",
        "children": [
          { "text": "北湖区", "value": "431002" },
          { "text": "苏仙区", "value": "431003" },
          { "text": "桂阳县", "value": "431021" },
          { "text": "宜章县", "value": "431022" },
          { "text": "永兴县", "value": "431023" },
          { "text": "嘉禾县", "value": "431024" },
          { "text": "临武县", "value": "431025" },
          { "text": "汝城县", "value": "431026" },
          { "text": "桂东县", "value": "431027" },
          { "text": "安仁县", "value": "431028" },
          { "text": "资兴市", "value": "431081" }
        ]
      },
      {
        "text": "永州市",
        "value": "431100",
        "children": [
          { "text": "零陵区", "value": "431102" },
          { "text": "冷水滩区", "value": "431103" },
          { "text": "祁阳市", "value": "431121" },
          { "text": "东安县", "value": "431122" },
          { "text": "双牌县", "value": "431123" },
          { "text": "道县", "value": "431124" },
          { "text": "江永县", "value": "431125" },
          { "text": "宁远县", "value": "431126" },
          { "text": "蓝山县", "value": "431127" },
          { "text": "新田县", "value": "431128" },
          { "text": "江华瑶族自治县", "value": "431129" }
        ]
      },
      {
        "text": "怀化市",
        "value": "431200",
        "children": [
          { "text": "鹤城区", "value": "431202" },
          { "text": "中方县", "value": "431221" },
          { "text": "沅陵县", "value": "431222" },
          { "text": "辰溪县", "value": "431223" },
          { "text": "溆浦县", "value": "431224" },
          { "text": "会同县", "value": "431225" },
          { "text": "麻阳苗族自治县", "value": "431226" },
          { "text": "新晃侗族自治县", "value": "431227" },
          { "text": "芷江侗族自治县", "value": "431228" },
          { "text": "靖州苗族侗族自治县", "value": "431229" },
          { "text": "通道侗族自治县", "value": "431230" },
          { "text": "洪江市", "value": "431281" }

